zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_EMIOS.h
#define eMIOS_OUDIS_OU2_MASK                     (0x4U)
#define eMIOS_OUDIS_OU2_SHIFT                    (2U)
#define eMIOS_OUDIS_OU2_WIDTH                    (1U)
#define eMIOS_OUDIS_OU2(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU2_SHIFT)) & eMIOS_OUDIS_OU2_MASK)

#define eMIOS_OUDIS_OU3_MASK                     (0x8U)
#define eMIOS_OUDIS_OU3_SHIFT                    (3U)
#define eMIOS_OUDIS_OU3_WIDTH                    (1U)
#define eMIOS_OUDIS_OU3(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU3_SHIFT)) & eMIOS_OUDIS_OU3_MASK)

#define eMIOS_OUDIS_OU4_MASK                     (0x10U)
#define eMIOS_OUDIS_OU4_SHIFT                    (4U)
#define eMIOS_OUDIS_OU4_WIDTH                    (1U)
#define eMIOS_OUDIS_OU4(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU4_SHIFT)) & eMIOS_OUDIS_OU4_MASK)

#define eMIOS_OUDIS_OU5_MASK                     (0x20U)
#define eMIOS_OUDIS_OU5_SHIFT                    (5U)
#define eMIOS_OUDIS_OU5_WIDTH                    (1U)
#define eMIOS_OUDIS_OU5(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU5_SHIFT)) & eMIOS_OUDIS_OU5_MASK)

#define eMIOS_OUDIS_OU6_MASK                     (0x40U)
#define eMIOS_OUDIS_OU6_SHIFT                    (6U)
#define eMIOS_OUDIS_OU6_WIDTH                    (1U)
#define eMIOS_OUDIS_OU6(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU6_SHIFT)) & eMIOS_OUDIS_OU6_MASK)

#define eMIOS_OUDIS_OU7_MASK                     (0x80U)
#define eMIOS_OUDIS_OU7_SHIFT                    (7U)
#define eMIOS_OUDIS_OU7_WIDTH                    (1U)
#define eMIOS_OUDIS_OU7(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU7_SHIFT)) & eMIOS_OUDIS_OU7_MASK)

#define eMIOS_OUDIS_OU8_MASK                     (0x100U)
#define eMIOS_OUDIS_OU8_SHIFT                    (8U)
#define eMIOS_OUDIS_OU8_WIDTH                    (1U)
#define eMIOS_OUDIS_OU8(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU8_SHIFT)) & eMIOS_OUDIS_OU8_MASK)

#define eMIOS_OUDIS_OU9_MASK                     (0x200U)
#define eMIOS_OUDIS_OU9_SHIFT                    (9U)
#define eMIOS_OUDIS_OU9_WIDTH                    (1U)
#define eMIOS_OUDIS_OU9(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU9_SHIFT)) & eMIOS_OUDIS_OU9_MASK)

#define eMIOS_OUDIS_OU10_MASK                    (0x400U)
#define eMIOS_OUDIS_OU10_SHIFT                   (10U)
#define eMIOS_OUDIS_OU10_WIDTH                   (1U)
#define eMIOS_OUDIS_OU10(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU10_SHIFT)) & eMIOS_OUDIS_OU10_MASK)

#define eMIOS_OUDIS_OU11_MASK                    (0x800U)
#define eMIOS_OUDIS_OU11_SHIFT                   (11U)
#define eMIOS_OUDIS_OU11_WIDTH                   (1U)
#define eMIOS_OUDIS_OU11(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU11_SHIFT)) & eMIOS_OUDIS_OU11_MASK)

#define eMIOS_OUDIS_OU12_MASK                    (0x1000U)
#define eMIOS_OUDIS_OU12_SHIFT                   (12U)
#define eMIOS_OUDIS_OU12_WIDTH                   (1U)
#define eMIOS_OUDIS_OU12(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU12_SHIFT)) & eMIOS_OUDIS_OU12_MASK)

#define eMIOS_OUDIS_OU13_MASK                    (0x2000U)
#define eMIOS_OUDIS_OU13_SHIFT                   (13U)
#define eMIOS_OUDIS_OU13_WIDTH                   (1U)
#define eMIOS_OUDIS_OU13(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU13_SHIFT)) & eMIOS_OUDIS_OU13_MASK)

#define eMIOS_OUDIS_OU14_MASK                    (0x4000U)
#define eMIOS_OUDIS_OU14_SHIFT                   (14U)
#define eMIOS_OUDIS_OU14_WIDTH                   (1U)
#define eMIOS_OUDIS_OU14(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU14_SHIFT)) & eMIOS_OUDIS_OU14_MASK)

#define eMIOS_OUDIS_OU15_MASK                    (0x8000U)
#define eMIOS_OUDIS_OU15_SHIFT                   (15U)
#define eMIOS_OUDIS_OU15_WIDTH                   (1U)
#define eMIOS_OUDIS_OU15(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU15_SHIFT)) & eMIOS_OUDIS_OU15_MASK)

#define eMIOS_OUDIS_OU16_MASK                    (0x10000U)
#define eMIOS_OUDIS_OU16_SHIFT                   (16U)
#define eMIOS_OUDIS_OU16_WIDTH                   (1U)
#define eMIOS_OUDIS_OU16(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU16_SHIFT)) & eMIOS_OUDIS_OU16_MASK)

#define eMIOS_OUDIS_OU17_MASK                    (0x20000U)
#define eMIOS_OUDIS_OU17_SHIFT                   (17U)
#define eMIOS_OUDIS_OU17_WIDTH                   (1U)
#define eMIOS_OUDIS_OU17(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU17_SHIFT)) & eMIOS_OUDIS_OU17_MASK)

#define eMIOS_OUDIS_OU18_MASK                    (0x40000U)
#define eMIOS_OUDIS_OU18_SHIFT                   (18U)
#define eMIOS_OUDIS_OU18_WIDTH                   (1U)
#define eMIOS_OUDIS_OU18(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU18_SHIFT)) & eMIOS_OUDIS_OU18_MASK)

#define eMIOS_OUDIS_OU19_MASK                    (0x80000U)
#define eMIOS_OUDIS_OU19_SHIFT                   (19U)
#define eMIOS_OUDIS_OU19_WIDTH                   (1U)
#define eMIOS_OUDIS_OU19(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU19_SHIFT)) & eMIOS_OUDIS_OU19_MASK)

#define eMIOS_OUDIS_OU20_MASK                    (0x100000U)
#define eMIOS_OUDIS_OU20_SHIFT                   (20U)
#define eMIOS_OUDIS_OU20_WIDTH                   (1U)
#define eMIOS_OUDIS_OU20(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU20_SHIFT)) & eMIOS_OUDIS_OU20_MASK)

#define eMIOS_OUDIS_OU21_MASK                    (0x200000U)
#define eMIOS_OUDIS_OU21_SHIFT                   (21U)
#define eMIOS_OUDIS_OU21_WIDTH                   (1U)
#define eMIOS_OUDIS_OU21(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU21_SHIFT)) & eMIOS_OUDIS_OU21_MASK)

#define eMIOS_OUDIS_OU22_MASK                    (0x400000U)
#define eMIOS_OUDIS_OU22_SHIFT                   (22U)
#define eMIOS_OUDIS_OU22_WIDTH                   (1U)
#define eMIOS_OUDIS_OU22(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU22_SHIFT)) & eMIOS_OUDIS_OU22_MASK)

#define eMIOS_OUDIS_OU23_MASK                    (0x800000U)
#define eMIOS_OUDIS_OU23_SHIFT                   (23U)
#define eMIOS_OUDIS_OU23_WIDTH                   (1U)
#define eMIOS_OUDIS_OU23(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU23_SHIFT)) & eMIOS_OUDIS_OU23_MASK)
/*! @} */

